# Задание 7: Многострочное описание персонажа
"""
Создайте переменные:
- имя = "Гарри"
- возраст = 17
- хобби = "квиддич"
Сформатируйте многострочный текст:
"""
"""
Персонаж: Гарри
Возраст: 17
Хобби: квиддич
"""
# Создаем переменные
name = "Гарри"
aga = 17
hobby = "квиддич"

# Форматируем многострочный текст
formatted_text = f"""
Персонаж: {name}
Возраст: {aga}
Хобби: {hobby}
"""

# Выводим результат
print(formatted_text)
