# Задание 3: Вывод температуры
"""
Создайте переменную:
- temperature = 36.678
Сформатируйте строку:
"Текущая температура: 36.68 градусов."
(округлите значение до двух знаков после запятой).
"""
# Создаем переменную
temperature = 36.678

# Форматируем строку
formatted_string = f"Текущая температура: {temperature:.2f} градусов."

# Выводим результат
print(formatted_string)
