# Задание 3: Работа с одинарными кавычками
"""
Создайте строку с текстом:
"It's a wonderful day!"
Используйте экранирование, чтобы текст корректно отобразился.
Выведите результат.
"""
# Создаем строку с экранированием
text = "It\'s a wonderful day!"

# Выводим результат
print(text)
