# Задание 3: Замена подстроки
"""
Создайте строку с текстом "Я изучаю Java".
- Замените слово "Java" на "Python".
- Выведите результат.
"""
# Создаем строку
text = "Я изучаю Java"

# Заменяем слово "Java" на "Python"
new_text = text.replace("Java", "Python")

# Выводим результат
print(new_text)
