# Задание 2: Многострочный вывод с переносом и табуляцией
"""
Сформируйте строку с текстом:
"План на день:
1. Завтрак
    - Овсянка
    - Чай
2. Работа
    - Проект A
    - Созвон"
Используйте символы переноса строки `\n` и табуляции `\t`.
Выведите результат.
"""
# Создаем строку с текстом
text = "План на день:\n1. Завтрак\n\t- Овсянка\n\t- Чай\n2. Работа\n\t- Проект A\n\t- Созвон"

# Выводим результат
print(text)
