# Задание 5: Выравнивание полей в таблице
"""
Используя переменные:
- item1 = "Яблоки"
- count1 = 5
- price1 = 1.50
- item2 = "Бананы"
- count2 = 12
- price2 = 0.80
Сформатируйте таблицу с выравниванием:
"Товар      Кол-во    Цена"
"Яблоки        5       1.50"
"Бананы       12       0.80"
"""
# Создаем переменные
item1 = "Яблоки"
count1 = 5
price1 = 1.50
item2 = "Бананы"
count2 = 12
price2 = 0.80

# Выводим таблицу с разделителями столбцов
print("-" * 34)
print(f"{'Товар':<10} | {'Кол-во':<10} | {'Цена':<10}")
print("-" * 34)
print(f"{item1:<10} | {count1:<10} | {price1:<10.2f}")
print(f"{item2:<10} | {count2:<10} | {price2:<10.2f}")
print("-" * 34)
