# Задание 9: Комбинация разных типов
"""
Создайте переменные:
- user = "Максим"
- score = 92.456
- level = 5
Сформатируйте строку:
"Игрок Максим, уровень: 5, очки: 92.46."
"""
# Создаем переменные
user = "Максим"
score = 92.456
level = 5

# Форматируем строку
formatted_string = f"Игрок {user}, уровень: {level}, очки: {score:.2f}."

# Выводим результат
print(formatted_string)
