# Задание 5: Объединение строки
"""
Создайте список: ["Привет", "мир", "Python"].
- Соедините элементы списка в одну строку, используя пробел в качестве разделителя.
- Выведите результат.
"""
# Создаем список
words = ["Привет", "мир", "Python"]

# Соединяем элементы списка в одну строку, используя пробел в качестве разделителя
sentence = " ".join(words)

# Выводим результат
print(sentence)
