# Задание 2: Удаление лишних пробелов
"""
Создайте строку с текстом "   Привет, Python!   ".
- Удалите пробелы в начале и конце строки.
- Выведите результат.
"""
# Создаем строку
text = "   Привет, Python!   "

# Удаляем пробелы в начале и конце строки
trimmed_text = text.strip()

# Выводим результат
print(trimmed_text)
