# Задание 1: Экранирование цитаты
"""
Создайте строку с текстом:
'Ильяс сказал: "Python — это просто, но мощно!"'
Используйте экранирование, чтобы текст корректно отобразился.
Выведите результат.
"""
# Создаем строку с экранированием
text = "Ильяс сказал: \"Python — это просто, но мощно!\""

# Выводим результат
print(text)
