# Задание 6: Разделы книги
"""
Создайте переменные:
- chapter1 = "Введение"
- pages1 = 12
- chapter2 = "Основы"
- pages2 = 45
Сформатируйте строку:
"1. Введение (12 стр.)\n2. Основы (45 стр.)"
"""
# Создаем переменные
chapter1 = "Введение"
pages1 = 12
chapter2 = "Основы"
pages2 = 45

# Форматируем строку
formatted_string = f"1. {chapter1} ({pages1} стр.)\n2. {chapter2} ({pages2} стр.)"

# Выводим результат
print(formatted_string)
