# Задание 9: Увеличение числа на 10
"""
Создайте метод add_ten(number), который принимает число.
Метод должен вернуть это число, увеличенное на 10.
Пример: для числа 15 метод должен вернуть 25.
"""
# Назначаем функцию
def add_ten(number):
    # Увеличиваем число на 10 и возвращаем результат
    return number + 10

# Вызов и вывод
print(add_ten(15))
