# Деление нацело
"""
В python данная операция обозначается знаком двойного слеша //. И допустим если вам надо нацело поделить a на b (a//b),
нужно ответить на вопрос: «Cколько раз второе число (в нашем случае b) умещается в первое?»

И попробуйте посчитать примеры ниже. Нажав на кнопку треугольника вы увидите правильные ответы
"""
print(21//5)
print(37//10)
print(42//6)
print(5//8)
print(17956//1000)
print(37//8)
"""
Остаток от деления в python обозначается знаком процента %. Чтобы посчитать, вы должны ответить на вопрос:
«Сколько останется от первого числа после того, как в него максимальное количество раз уместится второе число?»

И ниже на примерах проверьте правильно ли вы определяете остаток от деления
"""
print(31%5)
print(89%10)
print(35%7)
print(5%13)
print(8541%100)
print(37%8)