#Домашнее задание Nr.: 1.1
"""
    1. Установить на компьютер Python (сделано).
    2. Установить на компьютер PyCharm (сделано).
"""

# 3. Написать программу, которая выводит на экран фразу "Я изучаю программирование!".
print("Я изучаю программирование!")

# 4. На основе программы HelloWorld реализовать приложение, которое выводит следующую информацию ● Имя ● Фамилия ● Возраст ● Город
print("Здравствуйте.\n" + "Меня зовут Alexander Hermann" , " мне 52 года" , " я проживаю в пригороде города Osnabrück" , sep=',' , end='.')