#Напишите программу, которая принимает имя и фамилию пользователя, объединяет их в полное имя и выводит полное имя заглавными буквами.

# Вводим имя и фамилию пользователя
first_name = "Василий"
last_name = "Пупкин"

# Объединяем имя и фамилию в полное имя
full_name = first_name + " " + last_name

# Выводим полное имя заглавными буквами
print(full_name.upper())
