# 0. Самостоятельная работа. Даны два списка строк – ["A", "B", "C", "D", "E"] и ["D", "E", "F", "G"].
# Напишите функцию, которая возвращает третий список, содержащий все элементы обоих списков.
# Ожидаемый результат - ["A", "B", "C", "D", "E", "D", "E", "F", "G"].


def combining_lists():  # Определяем функцию.
    list_one = ["A", "B", "C", "D", "E"]  # Первый список строк.
    list_two = ["D", "E", "F", "G"]  # Второй список строк.
    for list_combining in list_two:  # Обходим элементы второго списка
        list_one.append(list_combining)  # Добавляем и в конец первого списка.
    return list_one  # Возвращаем результат


print(combining_lists())  # Вызываем функцию и выводим список.


# Ну или по проще:

def merge_lists(list1, list2):  # Определяем функцию.
    merged_list = list1 + list2  # Объединяем списки, используя оператор +
    return merged_list  # Возвращаем результат


list1 = ["A", "B", "C", "D", "E"]  # Первый список строк.
list2 = ["D", "E", "F", "G"]  # Второй список строк.
result = merge_lists(list1, list2)  # Вызываем функцию и передаем аргументы.
print(result)  # Выведет ["A", "B", "C", "D", "E", "D", "E", "F", "G"]
