# Задача 1: Счётчик чисел
"""
Напишите программу, которая с помощью цикла while выводит числа от 1 до 10.
"""

count = 0
while count < 11:
    print(count)
    count+=1
