#first_name = "Ильяс"
firstName = "Ильяс"
age = "33"

print("Меня зовут " + firstName + ", мне " + age + " года")

pi = 3.14
radius = 15
square = pi * radius * radius
print(square)

## типы данных
# традиционно на первом этапе выделяют 3 типа данных -
# целые числа (int), дробные числа (float) и строковые (str)

summ    = 10 + 2  # "+" - символ сложения, соответственно и операции сложения
substr  = 10 - 2  # "-" - символ вычитания, соответственно и операции вычитания
multipl = 10 * 2  # "*" - символ умножения, соответственно и операции умножение
divide  = 10 / 3  # "/" - символ деления, соответственно и операции деления на цело, то есть без остатка
remaindOfDiv = 10 % 3 # "%" - символ остатка, в результате останется та часть, которая не поделилась нацело (9(разделилось нацело) + 1 (остаток от деления))

print("===========================")
print(summ)
print(substr)
print(multipl)
print(divide)
print(remaindOfDiv)