"""
Пример диалога

    Бот:
    Привет! Я помогу вам оформить заказ. Давайте начнем с выбора основного блюда.
    Выберите основное блюдо:

        Пицца
        Паста
        Стейк

    Пользователь:
    1
"""


"""
    Бот:
    Какую пиццу вы хотите?

        Пепперони
        Маргарита
        Четыре сыра

    Пользователь:
    1
"""

"""
    Бот:
    Хотите добавить экстра?

        Сыр (+1.50€)
        Бекон (+2.00€)
        Острый соус (+1.00€)

    Пользователь:
    2
"""

"""
    Бот:
    Отлично! Теперь выберите салат:

        Цезарь
        Греческий
        Салат с тунцом

    Пользователь:
    1
"""

"""
    Бот:
    Хотите добавить экстра?

        Курица (+2.00€)
        Креветки (+4.00€)
        Дополнительный сыр (+1.00€)

    Пользователь:
    3

    Бот:
    Прекрасный выбор! Теперь выберите десерт:

        Чизкейк
        Маффин
        Тирамису

    Пользователь:
    2

    Бот:
    Хотите добавить экстра?

        Топпинг (шоколадный, карамельный, +1.00€)
        Орехи (+1.00€)
        Взбитые сливки (+1.50€)

    Пользователь:
    1

    Бот:
    Замечательно! Теперь выберите напиток:

        Кофе
        Чай
        Лимонад

    Пользователь:
    3

    Бот:
    Хотите добавить экстра?

        Лед (бесплатно)
        Фрукты (+2.00€)
        Мята (+0.80€)

    Пользователь:
    2

    Бот:
    Ваш заказ:

        Пицца Пепперони с беконом
        Салат Цезарь с дополнительным сыром
        Маффин с шоколадным топпингом
        Лимонад с фруктами

    Всё верно? Если хотите что-то изменить, напишите номер позиции:

        Основное блюдо
        Салат
        Десерт
        Напиток

    Пользователь:
    Да

    Бот:
    Кстати, у нас сегодня новые маффины с карамельной начинкой за 3.50€. Добавим?

    Пользователь:
    Нет

"""

"""
    Бот:
    Ваш окончательный заказ:

        Пицца Пепперони с беконом
        Салат Цезарь с дополнительным сыром
        Маффин с шоколадным топпингом
        Лимонад с фруктами

    Спасибо за заказ! Ожидайте доставку через 30 минут. Хорошего дня!

"""
print(f"""
        Пицца Пепперони с беконом
        Салат Цезарь с дополнительным сыром
        Маффин с шоколадным топингом
        Лимонад с фруктами

    Спасибо за заказ! Ожидайте доставку через 30 минут. Хорошего дня!""")